#define SI_IMPLEMENTATION 1

/*
 * MAJOR TODOS(EimaMei):
 * - Add documentation for every function, macro and what not.
 * - Rework the beginning text for more info.
 * - Make sure UNDEFINE macros work (and rename them to 'SI_NO_<feature>)'
 * - Check if all features 100% work on _all_ platforms.
 * - Add 'siliextra' stuff into sili.h.
 * - Remove the usage of 'LL' in favour of just type casting.
 * - Add documentation on how functions/macros are documented.
 * - Rename all functions, macros and variables to use the new naming scheme.
 * - Update the old examples.
 * - Add new examples.
 * - Complete the other TODOs in this file plus others.
 */

/*
sili.h - a cross-platform software toolchain for modern C programming
===========================================================================
	- YOU MUST DEFINE 'SI_IMPLEMENTATION' in EXACTLY _one_ C file that includes
	this header, BEFORE the include like this:

		#define SI_IMPLEMENTATION
		#include "sili.h"

	- All other files should just include the library without the #define macro.


	- If you want to disable certain features, you can do:
		- #define SI_PAIR_UNDEFINE
		- #define SI_OPTIONAL_UNDEFINE
		- #define SI_ARRAY_UNDEFINE
		- #define SI_STRING_UNDEFINE
		- #define SI_CHAR_UNDEFINE
		- #define SI_FILE_UNDEFINE
		- #define SI_THREAD_UNDEFINE
        - #define SI_BIT_UNDEFINE
		- #define SI_CPU_UNDEFINE
        - #define SI_PERFORMANCE_UNDEFINE

    #include <dirent.h>

	#include <sys/stat.h>
	#include <sys/fcntl.h>

	#include <stdio.h>
    #include <stdint.h>
    #include <inttypes.h>
#endif
#if defined(SI_SYSTEM_WINDOWS)
	#if !defined(SI_NO_WINDOWS_H)
		#define NOMINMAX            1
		#define WIN32_LEAN_AND_MEAN 1
		#define WIN32_MEAN_AND_LEAN 1
		#define VC_EXTRALEAN        1
		#include <windows.h>
		#undef NOMINMAX
		#undef WIN32_LEAN_AND_MEAN
		#undef WIN32_MEAN_AND_LEAN
		#undef VC_EXTRALEAN
	#endif

	#include <malloc.h>
	#include <intrin.h>
	#include <stdio.h>
	#include <time.h>
#else

#endif

#if defined(SI_SYSTEM_OSX)
    #include <sys/socket.h>
#endif

#if defined(SI_SYSTEM_UNIX)
    #include <sys/sendfile.h>
#endif


#if UINTPTR_MAX == UINT64_MAX
    #define SI_ARCH_64_BIT 1
#else
    #define SI_ARCH_32_BIT 1
#endif

#define SI_HOST_IS_BIG_ENDIAN      (!*(u8*)&(u16){1})
#define SI_HOST_IS_LITTLE_ENDIAN   (!SI_HOST_IS_BIG_ENDIAN)


#if defined(SI_COMPILER_MSVC)
	#if _MSC_VER < 1300
        typedef unsigned char     u8;
        typedef   signed char     i8;
        typedef unsigned short   u16;
        typedef   signed short   i16;
        typedef unsigned int     u32;
        typedef   signed int     i32;
	#else
        typedef unsigned __int8   u8;
        typedef   signed __int8   i8;
        typedef unsigned __int16 u16;
        typedef   signed __int16 i16;
        typedef unsigned __int32 u32;
        typedef   signed __int32 i32;
	#endif

	typedef unsigned __int64 u64;
	typedef   signed __int64 i64;
    #define PRIu64       "I64u"

    #define INT8_MIN     ((i8)_I8_MIN)
    #define INT8_MAX     _I8_MAX
    #define INT16_MIN    ((i16)_I16_MIN)
    #define INT16_MAX    _I16_MAX
    #define INT32_MIN    ((i32)_I32_MIN)
    #define INT32_MAX    _I32_MAX
    #define INT64_MIN    ((i64)_I64_MIN)
    #define INT64_MAX    _I64_MAX
    #define UINT8_MAX    _UI8_MAX
    #define UINT16_MAX   _UI16_MAX
    #define UINT32_MAX   _UI32_MAX
    #define UINT64_MAX   _UI64_MAX

#else
	typedef uint8_t   u8;
	typedef  int8_t   i8;
	typedef uint16_t u16;
	typedef  int16_t i16;
	typedef uint32_t u32;
	typedef  int32_t i32;
	typedef uint64_t u64;
	typedef  int64_t i64;
#endif

#if !defined(usize)
	typedef size_t      usize;
	typedef ptrdiff_t   isize;
#endif

#if !defined(uintptr)
	typedef usize  uintptr;
	typedef isize  intptr;
#endif

typedef u8 siByte;

#if defined(SI_ARCH_64_BIT)
	#define USIZE_MAX UINT64_MAX
	#define USIZE_MIN UINT64_MIN
	#define ISIZE_MAX INT64_MAX
	#define ISIZE_MIN INT64_MIN
#else
	#define USIZE_MAX UINT32_MAX
	#define USIZE_MIN UINT64_MIN
    #define ISIZE_MAX UINT32_MAX
    #define ISIZE_MIN UINT32_MIN
#endif


SI_STATIC_ASSERT(sizeof(u8) == sizeof(i8));
SI_STATIC_ASSERT(sizeof(u16) == sizeof(i16));
SI_STATIC_ASSERT(sizeof(u32) == sizeof(i32));
SI_STATIC_ASSERT(sizeof(u64) == sizeof(i64));
SI_STATIC_ASSERT(sizeof(usize) == sizeof(isize));

SI_STATIC_ASSERT(sizeof(u8)  == 1);
SI_STATIC_ASSERT(sizeof(u16) == 2);
SI_STATIC_ASSERT(sizeof(u32) == 4);
SI_STATIC_ASSERT(sizeof(u64) == 8);
SI_STATIC_ASSERT(sizeof(usize) == sizeof(size_t));


typedef float  f32;
typedef double f64;

SI_STATIC_ASSERT(sizeof(f32) == 4);
SI_STATIC_ASSERT(sizeof(f64) == 8);

#define SI_F32_MIN (1.17549435e-38f)
#define SI_F32_MAX (3.40282347e+38f)

#define SI_F64_MIN (2.2250738585072014e-308)
#define SI_F64_MAX (1.7976931348623157e+308)


#if !defined(b8)
    typedef u8   b8; /* NOTE(EimaMei): Don't use this as the primary boolean type. */
    typedef u16 b16;
    typedef u32 b32; /* NOTE(EimaMei): Use this as the default! */
    typedef u64 b64;
#endif

#if !defined(SI_LANGUAGE_CPP) && SI_STANDARD_VERSION <= SI_STANDARD_C17
    #ifndef true
        #define true 1
    #endif
    #ifndef false
        #define false 0
    #endif
#endif

SI_STATIC_ASSERT(sizeof(b8)  == 1);
SI_STATIC_ASSERT(sizeof(b16) == 2);
SI_STATIC_ASSERT(sizeof(b32) == 4);
SI_STATIC_ASSERT(sizeof(b64) == 8);

SI_STATIC_ASSERT(true == 1);
SI_STATIC_ASSERT(false == 0);


#if !defined(SI_LANGUAGE_CPP)
	#if defined(_MSC_VER) && _MSC_VER <= 1800
		#define inline __inline
	#elif !defined(__STDC_VERSION__)
		#define inline __inline__
	#else
		#define inline
	#endif
#endif

#ifdef intern
    #undef intern
#endif
#define intern static // TODO(EimaMei): Check the validity of this.

#if defined(SI_COMPILER_MSVC)
    /* asm - ASSEMBLY
     * Inserts inline assembly into the program using MSVC assembly syntax. */
    #define si_asm(... /* asm */) __asm  { __VA_ARGS__ }
#else
    #if defined(SI_CPU_X86) && defined(SI_GNUC_COMPLIANT)
        /* asm - cstring | ...IOR - ASM INPUT, OUTPUT OR REGISTERS
         * Inserts inline assembly into the program using GNU C assembly syntax. */
        #define si_asm(asm, .../* IOR */) \
            __asm__ __volatile__( \
                ".intel_syntax noprefix" SI_ASM_NL \
                asm SI_ASM_NL \
