/*
sili.h - An alternative to the C/C++ standard library.
===========================================================================
	- YOU MUST DEFINE 'SI_IMPLEMENTATION' in EXACTLY _one_ C file that includes this header, BEFORE the
	include like this:

		#define SI_IMPLEMENTATION
		#include "sili.h"

	- All other files should just include the library without the #define macro.


	- If you want to disable certain features, you can do:
		- #define SI_PAIR_UNDEFINE
		- #define SI_OPTIONAL_UNDEFINE
		- #define SI_ARRAY_UNDEFINE
		- #define SI_STRING_UNDEFINE
		- #define SI_CHAR_UNDEFINE
		- #define SI_FILE_UNDEFINE
	before the SI_IMPLEMENTATION macro, as well as before any other include of `sili.h`.
	- NOTE: Disabling certain features may or may not create 'undefined' compiler
	errors at certain spots. Use it at your own risk

===========================================================================

LICENSE
	- This software is dual-licensed to the public domain and under the MIT license
	(see the LICENSEs in the bottom of the file).

WARNING
	- This library is _slightly_ experimental and features may not work as expected.
	- This also means that many functions are not documented.

CREDITS
	- Ginger Bill's 'gb.h' for inspiring me to program the sili STL, as well as stuff taken from
	library and implemented here.
*/

#ifndef SI_INCLUDE_SI_H
#define SI_INCLUDE_SI_H

#if defined(__cplusplus)
extern "C" {
#endif


	#define SI_CPU_PPC 1
	#define SI_CACHE_LINE_SIZE 128

#elif defined(__arm__)
	#define SI_CPU_ARM 1
	#define SI_CACHE_LINE_SIZE 64

#elif defined(__MIPSEL__) || defined(__mips_isa_rev)
	#define SI_CPU_MIPS 1
	#define SI_CACHE_LINE_SIZE 64

#else
	#error Unknown CPU Type
#endif

#define SI_STATIC_ASSERT3(cond, msg) typedef char static_assertion_##msg[(!!(cond)) * 2 - 1] /* Note(EimaMei): This is absolutely stupid but somehow it works so who cares, really? */
#define SI_STATIC_ASSERT2(cond, line) SI_STATIC_ASSERT3(cond, static_assertion_at_line_##line)
#define SI_STATIC_ASSERT1(cond, line) SI_STATIC_ASSERT2(cond, line)

#define SI_STATIC_ASSERT(cond)        SI_STATIC_ASSERT1(cond, __LINE__)


#if defined(SI_SYSTEM_WINDOWS)
	#if !defined(_CRT_SECURE_NO_WARNINGS)
		#define _CRT_SECURE_NO_WARNINGS
	#endif
#endif

#if defined(SI_SYSTEM_UNIX)
	#if !defined(_GNU_SOURCE)
		#define _GNU_SOURCE
	#endif
	#define _LARGEFILE64_SOURCE
#endif

#if !defined(SI_SYSTEM_WINDOWS)
	#include <stdlib.h>
	#include <memory.h>
	#include <stdarg.h>
	#include <stddef.h>
	#include <errno.h>
	#include <unistd.h>

	#include <sys/stat.h>
	#include <sys/sendfile.h>
	#include <sys/fcntl.h>

	#include <stdio.h>

#endif
#if defined(SI_SYSTEM_WINDOWS)
	#if !defined(SI_NO_WINDOWS_H)
		#define NOMINMAX            1
		#define WIN32_LEAN_AND_MEAN 1
		#define WIN32_MEAN_AND_LEAN 1
		#define VC_EXTRALEAN        1
		#include <windows.h>
		#undef NOMINMAX
		#undef WIN32_LEAN_AND_MEAN
		#undef WIN32_MEAN_AND_LEAN
		#undef VC_EXTRALEAN
	#endif

	#include <malloc.h>
	#include <intrin.h>
	#include <stdio.h>
#else

#endif

#if defined(SI_SYSTEM_OSX)
#endif

#if defined(SI_SYSTEM_UNIX)
#endif

#if !defined(u8)
	typedef unsigned char       u8;
	typedef char                i8;
	typedef unsigned short     u16;
	typedef short              i16;
	typedef unsigned int       u32;
	typedef int                i32;
	typedef unsigned long long u64;
	typedef long long          i64;
#endif

#if !defined(usize)
	typedef size_t    usize;
	typedef ptrdiff_t isize;
#endif

#if !defined(uintptr)
	typedef usize uintptr;
	typedef isize  intptr;
#endif

typedef i8 siByte;

#define SI_UINT8_MAX 0xFF
#define SI_UINT8_MIN 0x00
#define SI_INT8_MAX  0x7F
#define SI_INT8_MIN  (-SI_INT8_MAX - 1)

#define SI_UINT16_MAX 0xFFFF
#define SI_UINT16_MIN 0x0000
#define SI_INT16_MAX  0x7FFF
#define SI_INT16_MIN  (-SI_INT16_MAX - 1)

#define SI_UINT32_MAX 0xFFFFFFFF
#define SI_UINT32_MIN 0x00000000
#define SI_INT32_MAX  0x7FFFFFFF
#define SI_INT32_MIN  (-SI_INT32_MAX - 1)
#define SI_UINT64_MAX 0xFFFFFFFFFFFFFFFF
#define SI_UINT64_MIN 0x0000000000000000
#define SI_INT64_MAX  0x7FFFFFFFFFFFFFFF
#define SI_INT64_MIN  (-SI_INT64_MAX - 1)


SI_STATIC_ASSERT(sizeof(u8) == sizeof(i8));
SI_STATIC_ASSERT(sizeof(u16) == sizeof(i16));
SI_STATIC_ASSERT(sizeof(u32) == sizeof(i32));
SI_STATIC_ASSERT(sizeof(u64) == sizeof(i64));

SI_STATIC_ASSERT(sizeof(u8)  == 1);
SI_STATIC_ASSERT(sizeof(u16) == 2);
SI_STATIC_ASSERT(sizeof(u32) == 4);
SI_STATIC_ASSERT(sizeof(u64) == 8);

SI_STATIC_ASSERT(sizeof(usize) == sizeof(isize));

#if !defined(bool)
	typedef u8   b8;
	typedef u16 b16;
	typedef u32 b32;
	typedef u64 b64;

	#ifndef __cplusplus
		typedef usize bool;

		#ifndef true
			#define true 1
		#endif
		#ifndef false
			#define false 0
		#endif
	#endif
#endif

#if !defined(nil)
	#define nil NULL
#endif

#if !defined(__cplusplus)
	#if defined(_MSC_VER) && _MSC_VER <= 1800
		#define inline __inline
	#elif !defined(__STDC_VERSION__)
		#define inline __inline__
	#else
		#define inline
	#endif
#endif

SI_STATIC_ASSERT(sizeof(uintptr) == sizeof(intptr));

typedef float  f32;
typedef double f64;

SI_STATIC_ASSERT(sizeof(f32) == 4);
SI_STATIC_ASSERT(sizeof(f64) == 8);

#if !defined(rawptr)
	typedef void* rawptr;
#endif


#define SI_BIT(x) (1 << (x))

#define SI_KILO(x) (       (x) * (usize)1024)
#define SI_MEGA(x) (SI_KILO(x) * (usize)1024)
#define SI_GIGA(x) (SI_MEGA(x) * (usize)1024)
#define SI_TERA(x) (SI_GIGA(x) * (usize)1024)

#define SI_OKAY  0
#define SI_ERROR -1

#define SI_UNUSED(x) (void)(x) /* NOTE(EimaMei) Should be used when you want to supress "parameter 'X' set but not used" errors. */

#if defined(SI_STANDARD_ANSI) || defined(SI_COMPILER_MSVC) /* NOTE(EimaMei): Fuck Microsoft */
	#define typeof(value) __typeof__(value)
#endif


usize si_impl_assert_msg(bool condition, const char* condition_str, const char* message, const char* file, i32 line);
#define SI_ASSERT_MSG(condition, message) si_impl_assert_msg(condition, #condition, message, __FILE__, __LINE__)
#define SI_ASSERT(condition) SI_ASSERT_MSG(condition, nil)
